Абонементы_дир_31/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
</mdclass:Catalog>

Абонементы_дир_31/src/Catalogs/ФизическиеЛица/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ToDo: Добавить вопрос об изменении полей Фамилия Имя Отчество
	РазложитьНаименованиеНаФИО();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	РазложитьНаименованиеНаФИО();
КонецПроцедуры

&НаКлиенте
Процедура ФамилияПриИзменении(Элемент)
	ФамилияИмяОтчествоПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ИмяПриИзменении(Элемент)
	ФамилияИмяОтчествоПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоПриИзменении(Элемент)
	ФамилияИмяОтчествоПриИзменении();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура РазложитьНаименованиеНаФИО()
	МассивСтрок = СтрРазделить(СокрЛП(Объект.Наименование), " ");
	
	Если МассивСтрок.Количество() >= 3 Тогда
		Объект.Фамилия = СокрЛП(МассивСтрок[0]);
		Объект.Имя = СокрЛП(МассивСтрок[1]);
		Объект.Отчество = СокрЛП(МассивСтрок[2]);
	ИначеЕсли МассивСтрок.Количество() = 2 Тогда
		Объект.Фамилия = СокрЛП(МассивСтрок[0]);
		Объект.Имя = СокрЛП(МассивСтрок[1]);
	Иначе
		Объект.Фамилия = Объект.Наименование;
	КонецЕсли;
КонецПроцедуры // РазложитьНаименованиеНаФИО

&НаКлиенте
Процедура ФамилияИмяОтчествоПриИзменении()					
	ФИО = Объект.Фамилия + " " + Объект.Имя + " " + Объект.Отчество;
	
	Элементы.Наименование.КнопкаВыпадающегоСписка = ЗначениеЗаполнено(ФИО);
	
	Если Элементы.Наименование.КнопкаВыпадающегоСписка Тогда
		Элементы.Наименование.СписокВыбора.Очистить();
		Элементы.Наименование.СписокВыбора.Добавить(ФИО);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
